[
{"title": "Patients are lining up for $2,500 full-body MRI scans that can detect cancer early", "timestamp": "Published Fri, Nov 10 2023", "content": "While celebrating the July Fourth holiday last year on a boat in Tyler, Texas, Dr. Julianne Santarosa received the results from her full-body MRI scan. What she saw put a damper on the festivities. Radiologists at  , which performed the scan, had identified a nodule in her lungs. Santarosa, who works as a spinal access surgeon in Dallas, could see the spot circled as she looked at the images from the patient portal on her phone. \"I was like, unless I swallowed a taco chip, that something should not be there,\" she told CNBC in an interview.  Before paying $2,500 for the Prenuvo scan, Santarosa, who was 41 at the time, hadn't felt any pain in and around her lungs and had no reason to suspect anything specific was wrong. Rather, she'd felt generally off since going through in vitro fertilization and had a gut feeling she should do the scan after seeing a Prenuvo ad on  . The day after seeing her Prenuvo results, Santarosa had a follow-up CT scan at a local hospital. The nodule was cancerous. She had it removed the following week. Curious and concerned patients like Santarosa are flooding Prenuvo's nine clinics in the U.S. and Canada. There's so much demand that the 5-year-old Silicon Valley-based company has announced 11 more locations opening by 2024, including one in London and another in Sydney. Kim Kardashian called Prenuvo a \"life saving machine\" in an August post on Instagram that's generated more than 3.4 million likes. Actress and model Cindy Crawford is an investor, alongside   ex-Chairman Eric Schmidt, 23andMe co-founder Anne Wojcicki and Nest Labs founder Tony Fadell. The company   late last year in a funding round led by Felicis Ventures. Prenuvo CEO Andrew Lacy said he wants to help customers understand what's going on beneath their skin, which his company's technology can do by identifying more than 500 conditions like cancer, multiple sclerosis and brain aneurysms. As of now, the scans have a limited audience because they aren't covered by insurers, requiring patients to pay out of pocket. For Santarosa, the imaging was worth every penny and more. Her cancer was detected early enough that she didn't need to undergo treatments like chemotherapy or radiation. More importantly, it hadn't spread to the point that it was life threatening. \"There's no screening test for this,\" Santarosa said. \"I would've been stage 4. I would've figured this out when I was coughing up blood.\" An MRI, which stands for magnetic resonance imaging, is traditionally used when ordered by a doctor. Interpreting the images is a complex science, and the scan alone can take more than an hour, even if it covers just part of the body. Prenuvo's custom MRI machines, which received clearance from the U.S. Food and Drug Administration in 2018, can scan a person's entire body in about an hour. Once a scan is complete, the images are reviewed by one of the company's 30 licensed radiologists. Customers usually receive their results back within five to 10 business days.   Waitlists are long. According to Prenuvo's website, the next available slot for a full-body scan in New York is in March. The same is true for the Los Angeles clinic. In the Dallas suburb of Irving, there's availability starting in mid-December. Lacy said the business has spiked as awareness in the past 12 months has grown \"incredibly.\" \"These days, when people ask me what I do, and I say I work at Prenuvo, it's 'Oh, I heard that on this podcast,' or 'That influencer talked about it,'\" he said. In addition to full-body scans, Prenuvo offers a head and torso scan for $1,800 and a scan of just the torso for $1,000. Lacy said Prenuvo is working to bring prices down through \"old-fashioned scaling.\" Some companies have started offering Prenuvo scans as a perk for employees, which has helped increase access to the technology. Lacy said it works for companies with self-funded insurance plans, because they're able to customize their offerings while assuming the risks. Traditional insurance companies are paying attention. \"Over time, that data helps inform insurance companies about whether this should be something that would be covered across the insurance plans that they offer,\" Lacy said. Prenuvo is looking for other ways to lower costs through artificial intelligence and by potentially reducing the durations of the scans even further. Lacy said the cost is directly correlated to the amount of time customers spend in the expensive machines.  Radiologists are at the core of Prenuvo's business. That brings its own challenges. Many radiologists are fighting burnout as an aging population has led to mounting caseloads. Emerging technologies like AI have also discouraged some young physicians from pursuing the practice. By 2034, the U.S. could see an estimated shortage of up to 35,600 radiologists and other specialists, according to a   from the Association of American Medical Colleges.  So far, it's a problem Prenuvo has managed to avoid.  Lacy said Prenuvo has a backlog of radiologists who want to work for the company. In traditional medicine, radiologists are often diagnosing patients with serious and advanced diseases, so identifying conditions early can be a welcome change, he said. \"When you're catching stage 1 cancer, what you're doing will save lives,\" Lacy said. Prenuvo is still in its early days. Medical experts caution that, in addition to the steep price, full-body MRI scans won't catch everything and aren't meant to replace targeted screenings like colonoscopies and mammograms. \"It is a tool that your physician and you can use, but it does not replace a full diagnostic examination,\" said Dr. Jasnit Makkar, an assistant professor of radiology at Columbia University Medical Center, in an interview. \"It is a work in progress.\" Dr. Kimberly Amrami, vice chair of the department of radiology at Mayo Clinic Rochester, said that because of the limitations, patients' expectations have to be set accordingly. She said it can be challenging to identify lesions in the lungs, for instance, and scanning different body parts like the knee, the pelvis, the breasts and the prostate all require different techniques.  \"There's always a wish to do an exam that's going to answer every question,\" Amrami said in an interview. \"It's just not really the way that it works with MRI in particular, because the way that you evaluate different body parts in different disease states is quite different.\" Prenuvo doesn't use contrast, a heavy metal that's injected into the blood vessels, when conducting its scans. Contrast can help radiologists visualize certain conditions better, but there's controversy surrounding its use, and the company doesn't want to deter people. Lacy said Prenuvo's hardware was designed to do \"almost as good a job\" as contrast by using other techniques.  \"We believe that that's the best possible solution for screening patients who are at normal risk and asymptomatic,\" he said. \"If we find something that's very concerning, oftentimes, we will suggest that the patient gets some type of follow-up dedicated imaging that might involve contrast.\" Amrami said people should consult with their physicians to determine what kind of imaging works best for them.  \"There is no one-size-fits-all for MRI,\" Amrami said. Lacy said he was inspired to create Prenuvo after he started to wonder about how his high-stress lifestyle was affecting his body. He previously started an internet search company and helped found a gaming company, among other ventures. He found a radiologist who was offering an early version of a full-body MRI scan. Lacy said he learned a lot from that experience.  \"Although my lifestyle was impacting my health, there was nothing crazy going on,\" Lacy said. \"I remember just this incredible feeling of peace of mind.\"  Prenuvo designed its experience for relaxation. Its New York location has the feel of a cross between a spa and a doctor's office. Upon arrival at the clinic, patients are led from a cozy waiting room to a private area where they can change into scrubs and remove their jewelry. While lying down in the machine, patients are given a pair of headphones and can choose to listen to music or watch TV during the scan. Dr. Eduardo Dolhun, a family physician in San Francisco, decided to get his first Prenuvo scan more than five years ago after Lacy stopped by his office. He said he was skeptical but intrigued by the technology, so he decided to fly to Vancouver, British Columbia, to try an early version of it.  After going through his results with a Prenuvo radiologist, Dolhun called one of his medical school peers at the Mayo Clinic.  \"I think this is going to change medicine,'\" Dolhun said, recalling the conversation. Dolhun said he gets a scan every 18 months or so and recommends it to some of his patients. He still advises them to get screening exams like physicals and mammograms as well. \"Good science takes time,\" he said.   ", "key_points": "Thousands of people have paid $2,500 for full-body MRI scans from Prenuvo, whose technology can detect more than 500 conditions. | The scans take about an hour and are reviewed by one of Prenuvo's licensed radiologists. | \"When you're catching stage one cancer, what you're doing will save lives,\" said Prenuvo CEO Andrew Lacy.", "url": "https://www.cnbc.com/2023/11/10/prenuvo-offers-2500-full-body-mri-scans-that-can-detect-cancer-early.html"},
{"title": "SpaceX worker injuries rise as Elon Musk accelerates Mars mission, report says", "timestamp": "Published Sat, Nov 11 2023", "content": "SpaceX employees have put their lives on the line to meet the aggressive pace of work that Chief Executive   has demanded in pursuit of a Mars mission, according to a Reuters  . The report documented over 600 previously undisclosed workplace injuries at SpaceX facilities since 2014, which Reuters said are only a part of the total number that is not publicly available. Reuters examined injury logs and public records from the company's six biggest facilities. SpaceX had not reported much of the injury data previously, in violation of regulatory standards. The investigation also included interviews with dozens of current and former SpaceX employees. Among the injury data that Reuters gathered, over 100 workers experienced cuts or lacerations, 29 broke or dislocated bones, 17 had their hands and fingers crushed and nine had some form of serious head injury. The unsafe workplace environment is a result of Musk's view that SpaceX is on the front lines of saving humanity from a deteriorating planet, workers told Reuters. He has accelerated work deadlines, forcing employees to work long hours at fast paces. To expedite productivity, workers also said that SpaceX dodges \"a certain amount of red tape.\" According to employee accounts from the investigation, senior SpaceX managers skirted safety protocols and product testing. Those shortcuts led to severe injuries, including employees suffering comas and sometimes, even death. The decline of workplace safety at SpaceX and the accelerated speed of work reflects the   of the space industry at large, where SpaceX is typically viewed as the top player. SpaceX, which makes rockets and operates Starlink, a satellite internet provider, has experienced rapid growth. It is currently valued at over  . Some expect the company to go   by 2027. But as competition in the industry grows fiercer, investment in space has shrunk over the past year. The industry-wide pressure has become part of the reason that companies like SpaceX have put increasing pressure on being the first to innovate.", "key_points": "A Reuters investigation discovered over 600 undisclosed workplace injuries at SpaceX. | Workers cited in the investigation said that the unsafe workplace is a product of Elon Musk's aggressive work expectations in pursuit of Mars mission. | The report gathered the workplace safety data via previously unreported injury logs, public records and interviews with current and former employees. ", "url": "https://www.cnbc.com/2023/11/11/spacex-worker-injuries-rise-as-elon-musk-accelerates-mars-mission-report.html"},
{"title": "Ripple CEO says SEC has lost sight of mission to protect investors", "timestamp": "Published Sat, Nov 11 2023", "content": "The CEO of blockchain company Ripple has some strong words for the U.S. Securities and Exchange Commission. Brad Garlinghouse told CNBC's Dan Murphy at the company's Ripple Swell conference in Dubai that he thinks the agency has lost sight of one of its key tasks as a regulator. \"I think the SEC, in my opinion, has lost sight of their mission to protect investors. And the question is, who are they protecting in this journey?\" Garlinghouse said Thursday. The SEC was not immediately available for comment when contacted by CNBC.  and its executives of conducting a $1.3 billion securities fraud via sales of XRP to retail investors. Ripple, the regulator alleged, failed to register an ongoing offer and sale of billions of XRP tokens to investors, depriving them of adequate disclosures about XRP and Ripple's business.  as a judge ruled that XRP is not in and of itself a security. Following this, the SEC was denied a request for an interlocutory appeal.  , the SEC dropped its securities law violation charges against Garlinghouse and Ripple executive Chris Larsen. The next key step in the case is the remedies discovery process. The SEC has 90 days from Nov. 9 to conduct remedies-related discovery, according to a proposed schedule submitted by the SEC. \"I think it is a positive step for the industry, not just for Ripple, not just for Chris and Brad, but for the whole industry, that the SEC has been put in check in the United States. And I'm hopeful this will be a thawing of the permafrost in the United States for really seeing an amazing industry that has immense potential thrive in the largest economy in the world,\" Garlinghouse told CNBC. Garlinghouse hopes that the U.S. will move beyond a situation where crypto regulation is dictated by a constant stream of litigation to a point where federal laws governing digital currencies are introduced by Congress. \"One of the things that people talk about is, one of the definitions of insanity is doing the same thing over and over again, and thinking you'll get a different outcome, the SEC is doing the same thing over and over again. And they think, I guess, they're gonna get a different outcome at some point,\" Garlinghouse continued. \"[Digital asset manager] Grayscale also had, I think, an important victory in the United States about the bitcoin ETF, where the judge had to get, a federal judge talking about a federal agency, the SEC, saying the SEC is being arbitrary and capricious,\" he added,   was wrong to reject an application from Grayscale to create a bitcoin ETF. \"Generally, judges tend to be pretty down the middle and try to not be dramatic — those are damning words. So I think at some point, the SEC has to step back and realize that their approach of regulation through enforcement, let's just bring lawsuits, that has to break.\" Ripple is a payments company that specializes in cross-border money transfers through the blockchain, a distributed database that records transactions across multiple computers. The company's RippleNet network is used by financial institutions to send funds from one country to another. Ripple also leverages XRP, a cryptocurrency, to make cross-border payments. The XRP token, which has become commonly associated with Ripple the company, is meant to act as a kind of \"bridge\" currency between one fiat currency and another as those transactions flow across countries. So, say you want to send some money from the U.S. to Mexico. Ripple's technology lets you do that by converting the   into XRP, transferring the XRP over to Mexico, and then converting it into Mexican pesos on the other side. By doing so, Ripple says, you don't need to have pre-funded accounts on the other side of a cross-border transaction in order to get that money. That's the business case for XRP from Ripple's point of view. But XRP in its most common usage is ultimately a token that investors speculate on. And when its price dropped like a stone — like other cryptocurrencies — in the 2018 crypto bear market, regulators got concerned about the impact of these digital currencies on retail investors. In Ripple's case, unlike bitcoin, the cryptocurrency is predominantly owned by Ripple, which holds a huge amount of XRP in an escrow account and releases tokens on a quarterly basis to a mix of institutional investors and retail investors via sales on cryptocurrency exchanges. This is a big part of how Ripple makes money. That has been a big point of contention for the SEC as it pursues its case against Ripple. Ripple, for its part, maintains that XRP shouldn't be considered a security and is more akin to a currency or commodity. Being designated a security would mean Ripple having to file lots of paperwork and disclosures with regulators, a process that could prove costly.", "key_points": "\"I think the SEC, in my opinion, has lost sight of their mission to protect investors,\" Ripple CEO Brad Garlinghouse told CNBC's Dan Murphy at the Ripple Swell event in Dubai. | Ripple was handed a pivotal victory in July as a judge ruled that XRP was not in and of itself a security; the next key step in the case is a remedies discovery process. | Garlinghouse hopes that the U.S. will move beyond a situation where crypto regulation is dictated by litigation to a point where federal laws governing digital currencies are introduced by Congress.", "url": "https://www.cnbc.com/2023/11/11/ripple-ceo-says-sec-has-lost-sight-of-mission-to-protect-investors.html"},
{"title": "Starlink’s rapid growth and influence has made it an indispensable part of Elon Musk’s SpaceX", "timestamp": "Published Sat, Nov 11 2023", "content": "Elon Musk's SpaceX is known for its frequent launches, which now   the space industry. But the satellites that the rockets send to space are just as important for the company as the launches. Starlink is SpaceX's answer to providing global, high-speed internet coverage using a network of thousands of satellites buzzing around the planet in a region known as low Earth orbit (LEO), about 342 miles above the Earth's surface. SpaceX launched its first batch of Starlink satellites in . Adoption of the service has ballooned since then. The company has said Starlink has more than 2 million active customers and is available on all seven continents and in over 60 countries. \"This growth is uncharacteristic in the sense of its magnitude. Whereas prior satellite service providers have ramped up to anywhere at most between 500,000 to a little bit over a million subscribers. And this has taken, you know, a ten-year period, Starlink's race to 2 million subscribers has taken only the better part of two years,\" says Brent Prokosh, a Senior Affiliate Consultant at Euroconsult. Experts estimate that the global market for consumer satellite services, including TV, radio, and broadband internet, was worth over $92 billion in 2022. And Starlink could be in a good position to capture a big piece of the market. Although initially conceived for the consumer segment, Starlink's offerings have expanded to serve enterprise customers including in the   and  .  \"Starlink's importance to SpaceX overall as a company is imperative. Euroconsult estimates that, optimistically, by the end of 2023, this business of Starlink could represent upwards of 40% of SpaceX's overall business. This total would be somewhere in excess of $3 billion generated from Starlink,\" Prokosh says. Starlink has been praised for its ability to connect remote parts of the world that would otherwise not have access to reliable internet. The service has also become indispensable in areas hit by   and, more recently, during times of conflict, particularly in the Russia-Ukraine war. \"The big benefit of Starlink and how it's being used in Ukraine today is communications. It's providing a pathway for the military, for civilians to stay connected to the outside world. It allows a pathway for the military to communicate with each other and to provide command and control direction to their forces,\" says Kari Bingen who is the Director of the Aerospace Security Project at the Center for Strategic and International Studies. But Starlink's growing influence is garnering condemnation from critics who say Musk is meddling in geopolitics. Meanwhile, the scientific community has its own concerns.  \"The astronomical community got concerned about the first launch of the Starlink satellite a few years ago because the projection of the full constellation of several tens of thousands of satellites in low Earth orbit was immediately seen as an interference to both the optical observation and to radio observation,\" says Piero Benvenuti, who is the Interim General Secretary, International Astronomical Union. To find out more about Starlink's rapid expansion and if it can continue, watch the  .", "key_points": "", "url": "https://www.cnbc.com/2023/11/11/the-rapid-rise-of-elon-musks-starlink-satellite-internet-business.html"},
{"title": "China's ICBC, the world's biggest bank, hit by cyberattack that reportedly disrupted Treasury markets", "timestamp": "Published Fri, Nov 10 2023", "content": "The U.S. financial services division of Chinese bank ICBC was hit with a cyberattack that reportedly disrupted the trading of Treasurys. Industrial and Commercial Bank of China , said Thursday that its financial services arm, called ICBC Financial Services, experienced a ransomware attack \"that resulted in disruption to certain\" systems. Immediately after discovering the hack, ICBC \"isolated impacted systems to contain the incident,\" the state-owned bank said. Ransomware is a type of cyberattack. It involves hackers taking control of systems or information and only letting them go once the victim has paid a ransom. It's a type of attack that has seen an explosion in popularity among bad actors in recent years. ICBC did not reveal who was behind the attack but said it has been \"conducting a thorough investigation and is progressing its recovery efforts with the support of its professional team of information security experts.\" The Chinese bank also said it is working with law enforcement. ICBC said it \"successfully cleared\" U.S. Treasury trades executed Wednesday and repo financing trades done on Thursday. A repo is a repurchase agreement, a type of short-term borrowing for dealers in government bonds. However, multiple news outlets reported there was disruption to U.S. Treasury trades.  , citing traders and banks, said Friday that the ransomware attack prevented the ICBC division from settling Treasury trades on behalf of other market participants. The U.S. Treasury Department told CNBC: \"We are aware of the cybersecurity issue and are in regular contact with key financial sector participants, in addition to federal regulators. We continue to monitor the situation.\" ICBC said the email and business systems of its U.S. financial services arm operate independently of ICBC's China operations. The systems of its head office, the ICBC New York branch, and other domestic and overseas affiliated institutions were not affected by the cyberattack, ICBC said. Wang Wenbin, spokesperson for China's Ministry of Foreign Affairs, said Friday that ICBC is striving to minimize the impact and losses after the attack, according to a   report. Speaking at a regular news conference, Wang said ICBC has paid close attention to the matter and has handled the emergency response and supervision well, the Reuters report said. Nobody has claimed responsibility for the attack yet and ICBC has not said who might be behind it. In the cybersecurity world, finding out who is behind a cyberattack is often very difficult due to the techniques hackers use to mask their locations and identities. But there are clues about what kind of software was used to carry out the attack. Marcus Murray, founder of Swedish cybersecurity firm Truesec, said the ransomware used is called LockBit 3.0. Murray said this information has come from sources with relations to Truesec, but was unable to reveal who those sources are due to confidentiality reasons.  , citing two sources, that LockBit 3.0 was the software behind the attack too. CNBC was unable to independently verify the information. This kind of ransomware can make its way into an organization in many ways. For example, by someone clicking on a malicious link in an email. Once in, its aim is to extract sensitive information about a company. The VMware cybersecurity team said in a blog last year that LockBit 3.0 is a \"challenge for security researchers because each instance of the malware requires a unique password to run without which analysis is extremely difficult or impossible.\" The researchers added that the ransomware is \"heavily protected\" against analysis. The U.S. government's Cybersecurity and Infrastructure Security Agency calls LockBit 3.0 \"more modular and evasive,\" making it harder to detect. LockBit is the most popular strain of ransomware, accounting for around 28% of all known ransomware attacks from July 2022 to June 2023, according to data from cybersecurity firm  . LockBit is the group behind the software. Its business model   It effectively sells its malicious software to other hackers, known as affiliates, who then go on to carry out the cyberattacks. The leader of the group goes by the online name of \"LockBitSup\" on dark web hacking forums. \"The group primarily posts in Russian and English, but according to its website, the group claims to be located in the Netherlands and to not be politically motivated,\" Flashpoint said in a blogpost. The group's malware is known to target small and medium-sized businesses. LockBit has previously claimed responsibility for ransomware attacks on   and the U.K's. Royal Mail.  a Russian national for his involvement in \"deploying numerous LockBit ransomware and other cyberattacks\" against computers in the U.S., Asia, Europe and Africa. \"LockBit actors have executed over 1,400 attacks against victims in the United States and around the world, issuing over $100 million in ransom demands and receiving at least as much as tens of millions of dollars in actual ransom payments made in the form of bitcoin,\" the DOJ   in a press release in June.", "key_points": "The U.S. financial services division of Chinese bank ICBC was hit by a cyberattack that reportedly affected the trade of U.S. Treasurys.  | ICBC, the world's largest lender by assets, said Thursday its financial services arm experienced a ransomware attack \"that resulted in disruption to certain\" systems. | Security expert have said ransomware from the hacking group LockBit was used to carry out the cyberattack on ICBC. ", "url": "https://www.cnbc.com/2023/11/10/icbc-the-worlds-biggest-bank-hit-by-ransomware-cyberattack.html"}
]